Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/account.po
Languages: es, fr

source: Creating an account
es: Crear una cuenta
fr: Créer un compte

source: How you sign up to IATI Publisher depends on whether your organisation has previously registered with IATI or not. You can find a list of organisations that have already registered and published data on the `IATI Registry`_.
es: La forma de inscribirse en IATI Publisher dependerá de si su organización ya se ha registrado en la IATI. Puede encontrar una lista de organizaciones que ya se han registrado y han publicado datos en el `Registro de la IATI`_.
fr: La manière dont vous vous connectez à IATI Publisher dépend du fait que votre organisation sʼest déjà inscrite à lʼIITA ou non. Vous trouverez une liste des organisations qui se sont déjà inscrites et ont déjà publié des données dans le `Registre de lʼIITA`_.

source: If you have never registered with IATI, follow the instructions below for `Option A: My organisation is new to IATI <https://docs.publisher.iatistandard.org/en/latest/account/#id1>`_. Otherwise, refer to `Option B: My organisation has registered with IATI <https://docs.publisher.iatistandard.org/en/latest/account/#id2>`_.
es: Si nunca se ha registrado en la IATI, siga estas instrucciones, correspondientes a la `Opción A: Mi organización es nueva en la IATI <https://docs.publisher.iatistandard.org/en/latest/account/#id1>`_. En caso contrario, elija la `Opción B: Mi organización está registrada en la IATI <https://docs.publisher.iatistandard.org/en/latest/account/#id2>`_.
fr: Si vous nʼavez pas encore procédé à votre inscription à lʼIITA, suivez les instructions ci-dessous pour l' `Option A : Mon organisation est nouvelle au sein de lʼIITA <https://docs.publisher.iatistandard.org/en/latest/account/#id1>`_. Dans le cas contraire, se reporter à l' `Option B : Mon organisation sʼest inscrite à lʼIITA <https://docs.publisher.iatistandard.org/en/latest/account/#id2>`_.

source: There are question mark icons next to each data entry field in IATI Publisher, which you can click on for guidance.
es: Haga clic en los signos de interrogación que acompañan a todos los campos de introducción de datos de IATI Publisher para informarse de en qué consiste cada uno.
fr: Des icônes en forme de point dʼinterrogation se trouvent à côté de chaque champ de saisie dans IATI Publisher, sur lesquelles vous pouvez cliquer pour obtenir des orientations.

source: Option A: My organisation is new to IATI
es: Opción A: Mi organización es nueva en la IATI
fr: Option A : Mon organisation est nouvelle au sein de lʼIITA

source: On the IATI Publisher homepage, click 'Join Now', then select 'My organisation is new to IATI'.
es: En la página de inicio de IATI Publisher, haga clic en "Únase ahora" y, a continuación, seleccione "Mi organización es nueva en la IATI".
fr: Sur la page dʼaccueil dʼIITA Publisher, Cliquez sur « Rejoignez-nous », puis sélectionnez « Mon organisation est nouvelle au sein de lʼIITA ».

source: Enter information about your organisation. Visit the `How to create your IATI organisation identifier`_ page for help.
es: Introduzca los datos relativos a su organización. Visite la página `Cómo crear su identificador de la organización de la IATI`_ para obtener ayuda.
fr: Saisissez les informations relatives à votre organisation. Consultez la page `Comment créer lʼidentifiant IITA de votre organisation`_ pour obtenir de lʼaide.

source: Enter contact information for your organisation, noting that this will be publicly visible.
es: Introduzca los datos de contacto de su organización, que serán visibles para el público.
fr: Saisissez les coordonnées de votre organisation, sachant quʼelles seront visibles par le public.

source: Select whether you are publishing data for your own organisation (Source = 'Primary') or on behalf of another organisation (Source = 'Secondary').
es: Seleccione si va a publicar datos para su propia organización (Fuente = "Principal") o en nombre de otra (Fuente = "Secundaria").
fr: Choisissez si vous publiez des données pour votre propre organisation (Source = « Primaire ») ou pour le compte dʼune autre organisation (Source = « Secondaire »).

source: Enter your own information to create an admin user account. This is the email address and password that you will use to sign in to IATI Publisher.
es: Introduzca sus propios datos para crear una cuenta de usuario administrador. Esta es la dirección de correo electrónico y la contraseña que utilizará para iniciar sesión en IATI Publisher.
fr: Saisissez vos propres informations pour créer un compte dʼutilisateur administrateur. Il sʼagit de lʼadresse électronique et du mot de passe que vous utiliserez pour vous connecter à IATI Publisher.

source: Click 'Get Started' to return to the homepage.
es: Haga clic en "Primeros pasos" para volver a la página de inicio.
fr: Cliquez sur « Premiers pas » pour revenir à la page dʼaccueil.

source: Option B: My organisation has registered with IATI
es: Opción B: Mi organización está registrada en la IATI
fr: Option B : Mon organisation sʼest inscrite à lʼIITA

source: On the IATI Publisher homepage, click 'Join Now', then select 'My organisation has registered with IATI'.
es: En la página de inicio de IATI Publisher, haga clic en "Únase ahora" y, a continuación, seleccione "Mi organización está registrada en la IATI".
fr: Sur la page dʼaccueil dʼIITA Publisher, Cliquez sur « Rejoignez-nous », puis sélectionnez « Mon organisation sʼest inscrite à lʼIITA ».

source: Enter your organisation details, making sure that your organisation name, identifier and publisher ID match your account information on the `IATI Registry`_.
es: Introduzca los datos de su organización, cerciorándose que el nombre de su organización, el identificador y el ID de la entidad que publica datos coincidan con la información de su cuenta en el `Registro de la IATI`_.
fr: Saisissez les coordonnées de votre organisation, en veillant à ce que le nom, lʼidentifiant et lʼidentifiant de lʼorganisme de publication correspondent aux informations de votre compte sur le `Registre de lʼITTA`_.

source: Enter your contact information to create an admin user account. This is the email address and password that you will use to sign in to IATI Publisher.
es: Introduzca sus datos de contacto para crear una cuenta de usuario administrador. Esta es la dirección de correo electrónico y la contraseña que utilizará para iniciar sesión en IATI Publisher.
fr: Saisissez vos coordonnées pour créer un compte dʼutilisateur administrateur. Il sʼagit de lʼadresse électronique et du mot de passe que vous utiliserez pour vous connecter à IATI Publisher.
