Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/basic-activity-data.po
Languages: es, fr

source: Creating an activity
es: Crear una actividad
fr: Créer une activité

source: The IATI data standard includes two types of data file - organisation and activity. The activity file includes information on the activities that your organisation carries out, such as your projects or humanitarian interventions. The IATI Standard includes data fields on what the activity is, where it is taking place, which organisations are involved and how it is financed.
es: La Norma IATI incluye dos tipos de archivos de datos: de organización y de actividad. El archivo de actividad incluye información sobre las actividades que lleva a cabo su organización, como los proyectos o intervenciones humanitarias. La Norma IATI incluye campos de datos relativos a en qué consiste la actividad, dónde se lleva a cabo, qué organizaciones participan en ella y cómo se financia.
fr: La norme de données de l'IITA comprend deux types de fichiers de données – organisation et activité. Le dossier d'activité comprend des informations sur les activités menées par votre organisation, telles que vos projets ou vos interventions humanitaires. La norme de lʼIITA comprend des champs de données sur la nature de l'activité, le lieu où elle se déroule, les organisations impliquées et la manière dont elle est financée.

source: Most users will create activities manually in the interface, by entering information about the activity in IATI Publisher's data entry forms. If you want to add multiple activities at once, see the section on `bulk importing <https://docs.publisher.iatistandard.org/en/latest/bulk-import/>`_.
es: La mayoría de los usuarios crearán actividades manualmente en la interfaz, introduciendo datos sobre la actividad en los correspondientes formularios de IATI Publisher. Si desea añadir varias actividades a la vez, consulte la sección sobre `importación masiva <https://docs.publisher.iatistandard.org/en/latest/bulk-import/>`_.
fr: La plupart des utilisateurs créeront des activités manuellement depuis l'interface, en saisissant des informations sur l'activité dans les formulaires de saisie dʼIATI Publisher. Si vous souhaitez ajouter plusieurs activités à la fois, consultez la section sur l'`importation groupée <https://docs.publisher.IITAstandard.org/en/latest/bulk-import/>`_.

source: Core elements
es: Elementos básicos
fr: Éléments de base

source: The IATI data elements that you can complete for an activity are listed on the left hand side of the activity page (Figure 1). Some are labelled “core” and have a yellow ring symbol.
es: Los elementos de datos de la IATI que puede completar para una actividad se enumeran en la parte izquierda de la página de la actividad (Figura 1). Algunos están etiquetados como "básicos" y tienen el símbolo de un anillo amarillo.
fr: Les éléments de données de lʼIITA que vous pouvez renseigner pour une activité sont listés sur le côté gauche de la page de l'activité (figure 1). Certains portent la mention « de base » et portent le symbole d'un anneau jaune.

source: It is recommended that you complete “core” elements. They are either mandatory according to the IATI Standard or required by most `donor governments’ publishing requirements <https://iatistandard.org/en/guidance/standard-overview/donors-reporting-requirements/>`_.
es: Se recomienda cumplimentar los elementos básicos. Son obligatorios según la Norma IATI o exigidos por la mayoría de los `requisitos de publicación de los gobiernos donantes <https://iatistandard.org/en/guidance/standard-overview/donors-reporting-requirements/>`_.
fr: Il est recommandé de renseigner les éléments « de base ». Ils sont soit obligatoires selon la norme de l'IITA, soit requis par la plupart des exigences de publication des `gouvernements donateurs <https://IITAstandard.org/en/guidance/standard-overview/donors-reporting-requirements/>`_.

source: Other elements are optional. You are still encouraged to populate as many optional fields as you can, however, as this makes your data more useful to IATI's data users.
es: Los demás elementos son facultativos. No obstante, le animamos a que rellene tantos campos facultativos como pueda, ya que esto hace que sus datos sean más útiles para los usuarios de la IATI.
fr: Les autres éléments sont facultatifs. Nous vous encourageons cependant à remplir autant de champs facultatifs que possible, car cela rend vos données plus utiles pour les utilisateurs de données de l'IITA.

source: IATI data elements that can be populated for an activity
es: Elementos de los datos de la IATI que pueden rellenarse para una actividad
fr: Éléments de données de l'IITA pouvant être renseignés pour une activité

source: Figure 1: The IATI data elements that can be populated for an activity.
es: Figura 1: Los elementos de datos de la IATI que pueden rellenarse para una actividad.
fr: Figure 1 : Éléments de données de l'IITA pouvant être renseignés pour une activité

source: Adding or editing activity information
es: Añadir o modificar la información de la actividad
fr: Ajouter ou modifier des informations sur l'activité

source: Click on each data element in the left hand menu of the activity page to add your data.
es: Haga clic en cada elemento de datos en el menú de la izquierda de la página de la actividad para añadir sus datos.
fr: Cliquez sur chaque élément de données dans le menu de gauche de la page d'activité pour ajouter vos données.

source: Mandatory fields are marked with a red asterisk (*) and are displayed towards the top of IATI Publisher’s data entry forms. These fields should always be populated to avoid errors in your published data.
es: Los campos obligatorios están marcados con un asterisco rojo (*) y aparecen en la parte superior de los formularios de introducción de datos de IATI Publisher. Estos campos deben rellenarse siempre para evitar errores en sus datos publicados.
fr: Les champs obligatoires sont marqués d'un astérisque rouge (*) et sont affichés en haut des formulaires de saisie dʼIATI Publisher. Ces champs doivent toujours être remplis afin d'éviter les erreurs dans les données publiées.

source: Optional fields are displayed in collapsed format towards the bottom of data entry forms. Use the arrow icons to expand and collapse these sections as needed.
es: Los campos facultativos se muestran en formato contraído cerca de la parte inferior de los formularios de introducción de datos. Utilice los iconos de flecha para expandir y contraer estas secciones según proceda.
fr: Les champs facultatifs sont affichés en format réduit au bas des formulaires de saisie. Utilisez les icônes en forme de flèche pour agrandir et réduire ces sections si nécessaire.

source: An example data entry form with mandatory fields highlighted at the top.
es: Ejemplo de formulario de introducción de datos con los campos obligatorios resaltados en la parte superior.
fr: Un exemple de formulaire de saisie de données dont les champs obligatoires sont mis en évidence en haut.

source: Figure 2: An example data entry form with mandatory fields highlighted at the top.
es: Figura 2: Ejemplo de formulario de introducción de datos con los campos obligatorios resaltados en la parte superior.
fr: Figure 2 : Un exemple de formulaire de saisie de données dont les champs obligatoires sont mis en évidence en haut.
