Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/bulk-import.po
Languages: es, fr

source: Bulk data import
es: Importación masiva de datos
fr: Importation de données groupées

source: IATI Publisher allows you to import and export activity data in three file formats (XML, CSV and XLSX). This functionality can be useful if you want to import multiple activities, transactions, budgets or results in one go.
es: IATI Publisher permite importar y exportar datos de actividades en tres formatos (XML, CSV y XLSX). Esta función puede ser útil si desea importar varias actividades, transacciones, presupuestos o resultados de una sola vez.
fr: IATI Publisher vous permet d'importer et d'exporter des données d'activité dans trois formats de fichiers (XML, CSV et XLSX). Cette fonctionnalité peut s'avérer utile si vous souhaitez importer plusieurs activités, transactions, budgets ou résultats en une seule fois.

source: All three file formats require complete activities to be uploaded (i.e. activities that include all mandatory elements according to the IATI Standard). New activities will be added to your list of activities in IATI Publisher. Existing activities (based on the activity identifier) will be overwritten.
es: Los tres formatos requieren que se carguen actividades completas (es decir, que incluyan todos los elementos obligatorios según la Norma IATI). Las nuevas actividades se añadirán a su lista de actividades en IATI Publisher. Las actividades existentes (basadas en el identificador de actividad) se sobrescribirán.
fr: Les trois formats de fichier exigent que des activités complètes soient téléversées (c'est-à-dire des activités comprenant tous les éléments obligatoires conformément à la norme de l'IITA). Les nouvelles activités seront ajoutées à votre liste d'activités dans IATI Publisher. Les activités existantes (sur la base de l'identifiant de l'activité) seront écrasées.

source: While it is possible to add new activities by bulk import, we normally recommend that activities are created manually in the IATI Publisher interface, with basic information entered first. The interface makes it clear which data elements are recommended vs. optional for a new activity.
es: Aunque es posible añadir nuevas actividades mediante la función de importación masiva, normalmente se recomienda crearlas manualmente en la interfaz de IATI Publisher, introduciendo primero la información básica. La interfaz deja claro qué elementos de datos son recomendables o facultativos para una nueva actividad.
fr: Bien qu'il soit possible d'ajouter de nouvelles activités par importation groupée, nous recommandons normalement de créer manuellement les activités depuis l'interface IATI Publisher, en commençant par saisir les informations de base. L'interface indique clairement quels éléments de données sont recommandés ou facultatifs pour une nouvelle activité.

source: **Example:** `How do I import transactions in bulk? <https://docs.publisher.iatistandard.org/en/latest/import-transactions/>`_
es: **Ejemplo:** `¿Cómo se hace una importación masiva de transacciones? <https://docs.publisher.iatistandard.org/en/latest/import-transactions/>`_
fr: **Exemple :** `Comment importer des transactions groupées ? <https://docs.publisher.IITAstandard.org/en/latest/import-transactions/>`_

source: IATI Publisher will overwrite your data in the interface if you upload data for an existing activity. Activity identifiers are checked during import to assess whether you are importing a new activity, or updating an existing one. Be careful to avoid losing data when overwriting existing activities.
es: Si carga datos de una actividad existente IATI Publisher los sobrescribirá en la interfaz. Los identificadores de actividad se comprueban durante la importación para evaluar si está importando una nueva actividad o actualizando una que ya existe. Tenga cuidado al sobrescribir actividades existentes para no perder datos.
fr: IATI Publisher écrasera vos données dans l'interface si vous téléversez des données pour une activité existante. Les identifiants d'activité sont vérifiés lors de l'importation afin de déterminer si vous importez une nouvelle activité ou si vous mettez à jour une activité existante. Veillez à ne pas perdre de données lorsque vous écrasez des activités existantes.

source: Exporting your existing data
es: Exportar datos existentes
fr: Exporter vos données existantes

source: As IATI Publisher's import functionality requires complete activities to be uploaded, if you are updating an existing activity, you will need to export the data you have entered for it in the interface first.
es: Dado que la función de importación de IATI Publisher requiere que se carguen actividades completas, si va a actualizar una actividad existente tendrá que exportar primero los datos que haya introducido para ella en la interfaz.
fr: Comme la fonction d'importation dʼIATI Publisher nécessite le téléversement d'activités complètes, si vous mettez à jour une activité existante, vous devrez d'abord exporter les données que vous avez saisies pour cette activité dans l'interface.

source: On the activity listing page, select the activity (or activities) that you want to edit or add data to.
es: En la página del listado de actividades, seleccione la actividad (o actividades) que desee modificar o a la que vaya a añadir datos.
fr: Sur la page de la liste des activités, sélectionnez l'activité (ou les activités) que vous souhaitez modifier ou à laquelle vous souhaitez ajouter des données.

source: Click the download icon to the left of the 'Publish Selected' button.
es: Haga clic en el icono de descarga situado a la izquierda del botón "Publicar las seleccionadas".
fr: Cliquez sur l'icône de téléchargement à gauche du bouton « Publier la sélection ».

source: Select which file format you want to work with from the drop-down menu:
es: Seleccione en el menú desplegable el formato de archivo con el que desea trabajar:
fr: Sélectionnez le format de fichier avec lequel vous souhaitez travailler depuis le menu déroulant :

source: Selecting activities to export data for from the activity listing page.
es: Selección de actividades para exportar datos desde la página del listado de actividades.
fr: Sélection des activités pour lesquelles des données doivent être exportées depuis la page de la liste des activités.

source: If you choose XML or CSV, your data file will be prepared in the background and automatically downloaded (this could take up to a few minutes).
es: Si elige XML o CSV, el archivo de datos se preparará en segundo plano y se descargará automáticamente (puede tardar unos minutos).
fr: Si vous choisissez le format XML ou CSV, votre fichier de données sera préparé en arrière-plan et téléchargé automatiquement (cela peut prendre quelques minutes).

source: If you choose XLSX files, IATI Publisher will show a progress bar as your data files are prepared. You will need to click 'Download' in the bottom-right task box when prompted:
es: Si elige archivos XLSX, IATI Publisher mostrará una barra de progreso a medida que se van preparando sus archivos de datos. Deberá hacer clic en "Descargar" en el cuadro de tareas de la parte inferior derecha cuando se le solicite:
fr: Si vous choisissez des fichiers XLSX, IATI Publisher affichera une barre de progression au fur et à mesure que vos fichiers de données seront préparés. Vous devrez cliquer sur « Télécharger » dans la boîte de tâches en bas à droite lorsquʼon vous y invitera :

source: Clicking the bottom-right 'Download' button when the XLS files have finished being prepared.
es: Hacer clic en el botón "Descargar" de la parte inferior derecha cuando los archivos XLS hayan terminado de prepararse.
fr: Cliquez sur le bouton « Télécharger » en bas à droite lorsque la préparation des fichiers XLS est terminée.

source: This will download a zipped (compressed) folder containing IATI Publisher's four XLSX templates.
es: Se descargará una carpeta comprimida que contiene las cuatro plantillas de XLSX de IATI Publisher.
fr: Ceci téléchargera un dossier zippé (compressé) contenant les quatre modèles XLSX dʼIATI Publisher.

source: Adding data
es: Añadir datos
fr: Ajout de données

source: Once you have exported your activity data, you can edit or add to the exported file as needed, then re-import it to update your activity. Avoid changing the template structure in any way - e.g. by deleting columns or renaming sheets.
es: Tras exportar los datos de su actividad, puede modificar el archivo exportado o añadirle todo lo que necesite y, a continuación, volver a importarlo para actualizar su actividad. Procure no modificar nunca la estructura de la plantilla, por ejemplo, eliminando columnas o cambiando el nombre de las hojas.
fr: Une fois que vous avez exporté vos données d'activité, vous pouvez modifier ou compléter le fichier exporté si nécessaire, puis le réimporter pour mettre à jour votre activité. Évitez de modifier la structure du modèle de quelque manière que ce soit, par exemple en supprimant des colonnes ou en renommant des feuilles.

source: See `How do I upload transactions in bulk? <https://docs.publisher.iatistandard.org/en/latest/import-transactions/>`_ as an example.
es: Véase `¿Cómo se hace una carga masiva de transacciones? <https://docs.publisher.iatistandard.org/en/latest/import-transactions/>`_ a modo de ejemplo.
fr: Voir `Comment téléverser des transactions groupées ? <https://docs.publisher.IITAstandard.org/en/latest/import-transactions/>`_ en guise dʼexemple.

source: Importing your data file
es: Importar su fichero de datos
fr: Importation de votre fichier de données

source: You can access the data import pages from 'Add or Import Activity' in IATI Publisher's header. Select the file format from the dropdown menu that you wish to use:
es: Puede acceder a las páginas de importación de datos desde "Añadir o importar actividad" en la cabecera de IATI Publisher. Seleccione en el menú desplegable el formato de archivo que desea utilizar:
fr: Vous pouvez accéder aux pages d'importation de données grâce à lʼoption « Ajouter ou importer une activité » dans l'en-tête dʼIATI Publisher. Sélectionnez depuis le menu déroulant le format de fichier que vous souhaitez utiliser :

source: A screenshot of the dropdown header menu, which allows the user to select whether they want to add activity data manually, via XML/CSV, or via XLSX file.
es: Captura de pantalla del menú desplegable de la cabecera, que permite al usuario seleccionar si desea añadir los datos de actividad manualmente, mediante XML/CSV o mediante un archivo XLSX.
fr: Capture d'écran du menu déroulant de l'en-tête, qui permet à l'utilisateur de choisir s'il souhaite ajouter des données d'activité manuellement, via XML/CSV ou via un fichier XLSX.

source: Import via XML
es: Importación mediante XML
fr: Importation via XML

source: XML is the file format used by the IATI Standard. IATI Publisher creates and stores IATI XML files for you when you publish your activity and organisation data from the interface. The XML import functionality may be useful if you are transferring IATI activity data from a different publishing tool to IATI Publisher.
es: XML es el formato de archivo utilizado por la Norma IATI. IATI Publisher crea y almacena archivos XML de la IATI para usted cuando publica sus datos de actividades y de la organización desde la interfaz. La función de importación XML puede ser útil si va a transferir datos de actividades de la IATI desde una herramienta de publicación que no sea IATI Publisher.
fr: XML est le format de fichier utilisé par la norme de lʼIITA. IATI Publisher crée et stocke les fichiers XML de lʼIITA pour vous lorsque vous publiez vos données d'activité et d'organisation depuis l'interface. La fonction d'importation via XML peut être utile si vous transférez des données d'activité de lʼIITA d'un autre outil de publication vers IATI Publisher.

source: Import via CSV
es: Importación mediante CSV
fr: Importation via CSV

source: You can download the IATI Publisher CSV template from the `CSV/XML data import page <https://publisher.iatistandard.org/import>`_. This template contains a wide range of IATI Standard fields and it is not necessary to populate everything. Refer to `IATI Standard guidance <https://iatistandard.org/en/iati-standard/203/activity-standard>`_ on how to interpret the fields.
es: Puede descargar la plantilla CSV de IATI Publisher desde la `página de importación de datos CSV/XML <https://publisher.iatistandard.org/import>`_. Esta plantilla contiene una amplia gama de campos de la Norma IATI y no es necesario rellenarlos todos. Consulte la `guía de la norma IATI <https://iatistandard.org/en/iati-standard/203/activity-standard>`_ para ver cómo se interpretan los campos.
fr: Vous pouvez télécharger le modèle CSV dʼIATI Publisher depuis la `page d'importation de données CSV/XML <https://publisher.IITAstandard.org/import>`_. Ce modèle contient un large éventail de champs standard de l'IITA et il n'est pas nécessaire de tout remplir. Reportez-vous au `guide standard de l'IITA <https://IITAstandard.org/en/IITA-standard/203/activity-standard>`_ pour savoir comment interpréter les champs.

source: It is not possible to upload results, indicators or periods for your activities via the CSV import. Use the XLSX import functionality instead.
es: No es posible cargar resultados, indicadores o períodos para sus actividades a través de la importación de CSV. Para ello debe utilizar la función de importación de XLSX.
fr: Il n'est pas possible de téléverser des résultats, des indicateurs ou des périodes pour vos activités via l'importation de fichiers CSV. Utilisez plutôt la fonctionnalité d'importation via XLSX.

source: Import via XLSX
es: Importar mediante XLSX
fr: Importation via XLSX

source: There are four templates available on the `XLSX import page <https://publisher.iatistandard.org/import/xls>`_. These cover basic activity data, results, indicators and periods.
es: En la `página de importación XLSX <https://publisher.iatistandard.org/import/xls>`_ hay cuatro plantillas. Abarcan los datos básicos de la actividad, los resultados, los indicadores y los períodos.
fr: Quatre modèles sont disponibles sur la `page d'importation via XLSX <https://publisher.IITAstandard.org/import/xls>`_. Ils couvrent les données d'activité de base, les résultats, les indicateurs et les périodes.

source: See `Which import template should I use? <https://docs.publisher.iatistandard.org/en/latest/which-template/>`_ for help choosing the right template. If you are not publishing results data, you only need to use the 'Basic Activity Data' template.
es: Consulte `¿Qué plantilla de importación debo utilizar? <https://docs.publisher.iatistandard.org/en/latest/which-template/>`_ para ver cuál es la que más le conviene. Si no va a publicar datos de resultados, solo tiene que utilizar la plantilla "Datos básicos de las actividades".
fr: Voir `Quel modèle d'importation dois-je utiliser ? <https://docs.publisher.IITAstandard.org/en/latest/which-template/>`_ pour vous aider à choisir le bon modèle. Si vous ne publiez pas de données de résultats, il vous suffit d'utiliser le modèle « Données d'activité de base ».

source: Pre-import checks
es: Controles previos a la importación
fr: Contrôles préalables à l'importation

source: Once you have uploaded your data, IATI Publisher will list the activities ready for import with information on any data validation errors. These errors are from the `IATI Validator <https://validator.iatistandard.org/>`_.
es: Una vez que haya cargado sus datos, IATI Publisher enumerará las actividades listas para importarse con información sobre cualquier error de validación de datos. Estos errores proceden del `Validador de la IATI <https://validator.iatistandard.org/>`_.
fr: Une fois que vous avez téléversé vos données, IATI Publisher énumère les activités prêtes à être importées et fournit des informations sur les éventuelles erreurs de validation des données. Ces erreurs proviennent de lʼ`outil de validation de lʼIITA <https://validator.IITAstandard.org/>`_.

source: Critical errors prevent the activity from being imported, whereas other errors will not prevent import. It is usually easier to fix errors in your data file before importing, rather than after in the interface.
es: Los errores críticos impiden importar la actividad, los demás no. Por lo general, es más fácil corregir los errores en el archivo de datos antes de la importación que después en la interfaz.
fr: Les erreurs critiques empêchent l'importation de l'activité, tandis que les autres erreurs n'empêchent pas l'importation. Il est généralement plus facile de corriger les erreurs dans votre fichier de données avant l'importation, plutôt qu'après depuis l'interface.

source: You will have the chance to confirm the activities that you want to add or overwrite on the 'Import Activity' page:
es: Podrá confirmar las actividades que desea añadir o sobrescribir en la página "Importar actividad":
fr: Vous aurez la possibilité de confirmer les activités que vous souhaitez ajouter ou remplacer sur la page « Importer une activité » :

source: The 'Import Activity' screen allows you to confirm which activities you want to add or update.
es: La pantalla "Importar actividad" le permite confirmar qué actividades desea añadir o actualizar.
fr: La page « Importer une activité » vous permet de confirmer les activités que vous souhaitez ajouter ou mettre à jour.
