Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/default-values.po
Languages: es, fr

source: Default values
es: Valores predeterminados
fr: Valeurs par défaut

source: Default values are fields such as language and currency, which occur often in the IATI Standard. It is easiest to populate these once so that IATI Publisher can automatically apply them to any new data you enter in the tool.
es: Los valores predeterminados son campos como el idioma y la moneda, que aparecen con frecuencia en la Norma IATI. Lo más fácil es rellenarlos una vez para que IATI Publisher pueda aplicarlos automáticamente a cualquier dato nuevo que introduzca en la herramienta.
fr: Les valeurs par défaut sont des champs tels que la langue et la devise, qui reviennent souvent dans la norme de lʼIITA. Il est plus facile de les remplir une seule fois afin quʼIATI Publisher puisse les appliquer automatiquement à toutes les nouvelles données que vous saisissez dans l'outil.

source: You will be prompted to complete default values in Step 2 of the 'Get Started' onboarding guidance, which appears after you first sign in.
es: Se le pedirá que complete los valores predeterminados en el paso 2 de la guía de incorporación "Primeros pasos", que aparece después de iniciar sesión por primera vez.
fr: Vous devrez renseigner les valeurs par défaut à l'étape 2 du guide d'accueil « Premiers pas », qui s'affiche après votre première connexion.

source: Which defaults should I populated?
es: ¿Qué valores predeterminados debo rellenar?
fr: Quels sont les paramètres par défaut que je dois renseigner ?

source: We strongly recommend that you populate your default language and currency. There are other recommended default values that are often required by `donor governments’ IATI requirements <https://iatistandard.org/en/guidance/standard-overview/donors-reporting-requirements/>`_, depending on who your funder is.
es: Le recomendamos encarecidamente que introduzca su idioma y moneda predeterminados. Hay otros valores predeterminados recomendados que se suelen exigir en los `requisitos de la IATI de los gobiernos donantes <https://iatistandard.org/en/guidance/standard-overview/donors-reporting-requirements/>`_, dependiendo de quién sea su financiador.
fr: Nous vous recommandons vivement de renseigner votre langue et votre devise par défaut. Il existe d'autres valeurs par défaut recommandées qui sont souvent requises au titre des `exigences de l'IITA des gouvernements donateurs <https://IITAstandard.org/en/guidance/standard-overview/donors-reporting-requirements/>`_, en fonction de l'identité de votre bailleur de fonds.

source: Click the question mark icon next to each default value's data entry box in IATI Publisher to view more information on what it is.
es: Haga clic en el icono del signo de interrogación situado junto a la casilla de introducción de datos de cada valor predeterminado en IATI Publisher para obtener más información acerca de en qué consiste.
fr: Cliquez sur l'icône représentant un point d'interrogation à côté du champ de saisie de chaque valeur par défaut dans IATI Publisher pour obtenir plus d'informations sur la valeur en question.

source: **Recommended defaults for activity data** - these are commonly required by funders, who may provide specific advice on how to complete them.
es: **Valores predeterminados recomendados para los datos de las actividades**: los financiadores suelen exigirlos y pueden ofrecer asesoramiento específico sobre cómo cumplimentarlos.
fr: **Paramètres par défaut recommandés pour les données d'activité** – ces paramètres sont généralement exigés par les financeurs, qui peuvent fournir des conseils spécifiques sur la manière de les renseigner.

source: **Optional defaults for activity data** - these are not required by the IATI Standard or most funders. You can populate them if relevant to your organisation's activities.
es: **Valores predeterminados opcionales para los datos de las actividades**: no son exigidos por la Norma IATI ni por la mayoría de los financiadores. Puede rellenarlos si son pertinentes para las actividades de su organización.
fr: **Paramètres par défaut facultatifs pour les données d'activité** – ces données ne sont pas exigées par la norme de lʼIITA ou la plupart des bailleurs de fonds. Vous pouvez les renseigner sʼils sont pertinents pour les activités de votre organisation.

source: Changing your default values
es: Cambiar los valores predeterminados
fr: Modifier vos valeurs par défaut

source: You can view or edit your default values in IATI Publisher's `Settings <https://publisher.iatistandard.org/setting>`_ at any time. IATI Publisher will apply the updated values to any new activities that you create in the interface.
es: Puede ver o modificar sus valores predeterminados en `Configuración <https://publisher.iatistandard.org/setting>`_ de IATI Publisher en cualquier momento. IATI Publisher aplicará los valores actualizados a las nuevas actividades que cree en la interfaz.
fr: Vous pouvez à tout moment consulter ou modifier vos valeurs par défaut depuis les `Paramètres <https://publisher.IITAstandard.org/setting>`_ dʼIATI Publisher. IATI Publisher appliquera les valeurs mises à jour à toutes les nouvelles activités que vous créerez depuis l'interface.

source: You can change default values for an individual activity by clicking 'Override this activity’s default values' in the top right of the screen when editing the activity. This will apply the new values to the specific activity, but not affect the defaults stored in Settings.
es: Puede cambiar los valores predeterminados de una actividad individual haciendo clic en "Reemplazar los valores predeterminados de esta actividad", en la parte superior derecha de la pantalla al modificar la actividad. Esto aplicará los nuevos valores a la actividad de que se trate, pero no afectará a los valores predeterminados almacenados en Configuración.
fr: Vous pouvez modifier les valeurs par défaut d'une activité individuelle en cliquant sur « Remplacer les valeurs par défaut de cette activité » en haut à droite de l'écran lors de la modification de l'activité. Les nouvelles valeurs seront appliquées à l'activité spécifique, mais n'affecteront pas les valeurs par défaut stockées dans les paramètres.
