Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/financials.po
Languages: es, fr

source: Budgets and transactions
es: Presupuestos y transacciones
fr: Budgets et transactions

source: Budgets are for each financial quarter (or year) over the lifetime of an activity. They are useful to give recipient countries predictability of funding and to inform their planning.
es: Los presupuestos se corresponden a cada trimestre (o año) financiero que dure una actividad. Son útiles para dar a los países beneficiarios previsibilidad en la financiación y fundamentar su planificación.
fr: Les budgets sont établis pour chaque trimestre financier (ou année financière) tout au long de la durée de vie d'une activité. Ils sont utiles pour donner aux pays bénéficiaires les moyens d'anticiper les financements et pour éclairer leur planification.

source: Transactions are a record of the incoming or outgoing funds for an activity. They have a date (in the past), value, provider organisation and recipient organisation.
es: Las transacciones son un registro de los fondos que entran o salen de una actividad. Tienen una fecha (en el pasado), un valor, una organización proveedora y una organización receptora.
fr: Les transactions sont un registre des entrées et sorties de fonds pour une activité. Elles comportent une date (dans le passé), une valeur, une organisation prestataire et une organisation bénéficiaire.

source: Add budgets or transactions individually in IATI Publisher's data entry forms, or in bulk via the `bulk import functionality <https://docs.publisher.iatistandard.org/en/latest/bulk-import/>`_.
es: Añada presupuestos o transacciones de forma individual en los formularios de introducción de datos de IATI Publisher, o de forma masiva mediante la `función de importación masiva <https://docs.publisher.iatistandard.org/en/latest/bulk-import/>`_.
fr: Ajoutez des budgets ou des transactions individuellement dans les formulaires de saisie dʼIATI Publisher, ou de manière groupée grâce à la `fonction d'importation groupée <https://docs.publisher.iatistandard.org/en/latest/bulk-import/>`_.

source: Adding budgets
es: Añadir presupuestos
fr: Ajouter des budgets

source: Locate "budget" in the left hand menu of elements for your activity, then click 'Edit' to open the data entry form (Figure 1).
es: Vaya a "Presupuesto" en el menú izquierdo de los elementos de su actividad y, a continuación, haga clic en "Editar" para abrir el formulario de introducción de datos (Figura 1).
fr: Localisez « budget » dans le menu de gauche des éléments de votre activité, puis cliquez sur « Modifier » pour ouvrir le formulaire de saisie des données (figure 1).

source: You can add as many budgets as you need, noting that each budget period should be no longer than one year.
es: Puede añadir tantos presupuestos como necesite, teniendo en cuenta que ningún período presupuestario puede ser superior a un año.
fr: Vous pouvez ajouter autant de budgets que nécessaire, sachant que chaque période budgétaire ne doit pas dépasser un an.

source: Viewing and editing budget information from the activity detail page.
es: Visualización y modificación de la información presupuestaria desde la página de detalles de la actividad.
fr: Visualisation et modification des informations budgétaires depuis la page descriptive de l'activité.

source: Figure 1: Viewing and editing budget information from the activity detail page.
es: Figura 1: Visualización y modificación de la información presupuestaria desde la página de detalles de la actividad.
fr: Figure 1 : Visualisation et modification des informations budgétaires depuis la page descriptive de l'activité.

source: Adding transactions
es: Añadir transacciones
fr: Ajout de transactions

source: Locate "transaction" in the activity element menu, then select a transaction to edit or click 'Add Transaction' to create a new one (Figure 2).
es: Vaya a "Transacción" en el menú de los elementos de la actividad y, a continuación, seleccione una transacción para modificarla o haga clic en "Añadir transacción" para crear una nueva (Figura 2).
fr: Localisez « transaction » dans le menu des éléments de l'activité, puis sélectionnez une transaction à modifier ou cliquez sur « Ajouter une transaction » pour en créer une nouvelle (figure 2).

source: Viewing and editing transaction information from the activity detail page.
es: Visualización y modificación de la información de las transacciones desde la página de detalles de la actividad.
fr: Visualisation et modification des informations relatives à la transaction depuis la page descriptive de l'activité.

source: Figure 2: Viewing and editing transaction information from the activity detail page.
es: Figura 2: Visualización y modificación de la información de las transacciones desde la página de detalles de la actividad.
fr: Figure 2 : Visualisation et modification des informations relatives à la transaction depuis la page descriptive de l'activité.

source: Information such as sector, recipient country and recipient region can be provided at either activity or transaction level, but not at both. If you have already populated this information at activity level, you won't be able to edit it in the transaction data entry form.
es: Puede facilitarse información como el sector, el país receptor y la región receptora en el nivel de la actividad o de la transacción, pero no en ambos. Si ya ha rellenado esta información en el nivel de la actividad, no podrá modificarla en el formulario de introducción de datos de la transacción.
fr: Des informations telles que le secteur, le pays bénéficiaire et la région bénéficiaire peuvent être fournies au niveau de l'activité ou de la transaction, mais pas aux deux niveaux. Si vous avez déjà renseigné ces informations au niveau de l'activité, vous ne pourrez pas les modifier dans le formulaire de saisie des données de la transaction.

source: The Transaction List is another way to view your activity transactions (Figure 3). The table can be filtered or sorted to help you manage a large number of transactions in the interface.
es: La Lista de transacciones es otra forma de ver las transacciones de su actividad (Figura 3). La tabla puede filtrarse u ordenarse para ayudarle a gestionar un gran número de transacciones en la interfaz.
fr: La liste des transactions est un autre moyen de visualiser les transactions de votre activité (figure 3). Le tableau peut être filtré ou trié pour vous aider à gérer un grand nombre de transactions dans l'interface.

source: Viewing and editing transaction information from the Transaction List.
es: Visualización y modificación de la información de las transacciones desde la Lista de transacciones.
fr: Visualisation et modification des informations relatives aux transactions depuis la liste des transactions.

source: Figure 3: Viewing the Transaction List for an activity.
es: Figura 3: Visualización de la Lista de transacciones de una actividad.
fr: Figure 3 : Visualisation de la liste des transactions pour une activité.
