Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/import-transactions.po
Languages: es, fr

source: How do I import transactions in bulk?
es: ¿Cómo se hace una importación masiva de transacciones?
fr: Comment importer des transactions groupées ?

source: You can use IATI Publisher's bulk import functionality to add or edit transactions for your existing activities. This involves exporting your existing activity data first and selecting which file format you want to work with (CSV or XLSX).
es: Puede utilizar la función de importación masiva de IATI Publisher para añadir o modificar transacciones para las actividades ya creadas. Para ello, primero hay que exportar los datos de actividades existentes y seleccionar el formato de archivo con el que se desea trabajar (CSV o XLSX).
fr: Vous pouvez utiliser la fonction d'importation groupée dʼIATI Publisher pour ajouter ou modifier des transactions pour vos activités existantes. Pour ce faire, vous devez d'abord exporter vos données d'activité existantes et sélectionner le format de fichier avec lequel vous souhaitez travailler (CSV ou XLSX).

source: `Importing via CSV <https://docs.publisher.iatistandard.org/en/latest/import-transactions/#id1>`_
es: `Importación mediante CSV <https://docs.publisher.iatistandard.org/en/latest/import-transactions/#id1>`_
fr: `Importation via CSV <https://docs.publisher.iatistandard.org/en/latest/import-transactions/#id1>`_

source: `Importing via XLSX <https://docs.publisher.iatistandard.org/en/latest/import-transactions/#id2>`_
es: `Importación mediante XLSX <https://docs.publisher.iatistandard.org/en/latest/import-transactions/#id2>`_
fr: `Importation via XLSX <https://docs.publisher.iatistandard.org/en/latest/import-transactions/#id2>`_

source: Importing via CSV
es: Importación mediante CSV
fr: Importation via CSV

source: Follow the instructions for `exporting your activity data in CSV format <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_.
es: Siga las instrucciones para `exportar los datos de actividades en formato CSV <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_.
fr: Suivez les instructions pour `exporter vos données d'activité au format CSV <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_.

source: In the downloaded CSV file, locate columns AH to BB to view your activity transaction data:
es: En el archivo CSV descargado, localice las columnas AH a BB para ver los datos de las transacciones de su actividad:
fr: Dans le fichier CSV téléchargé, localisez les colonnes AH à BB pour visualiser vos données de transaction d'activité :

source: Columns containing transaction data in the exported CSV file.
es: Columnas que contienen datos de transacciones en el archivo CSV exportado.
fr: Colonnes contenant les données de transaction dans le fichier CSV exporté.

source: Add new transaction data on this sheet (one row per transaction). Data on this sheet will overwrite any existing transaction data in IATI Publisher, so make sure that you do not remove rows that you want to keep. Refer to the `transaction type codelist <https://iatistandard.org/en/iati-standard/203/codelists/transactiontype/>`_ to understand the different numerical codes you can enter in this column.
es: Añada nuevos datos de transacción en esta hoja (una fila por transacción). Los datos de esta hoja se sobrescribirán por encima de cualquier dato de transacción que haya en IATI Publisher, por lo que deberá tener cuidado de no eliminar filas que desee conservar. Consulte la `lista de códigos de tipos de transacción <https://iatistandard.org/en/iati-standard/203/codelists/transactiontype/>`_ para ver a qué corresponden los diferentes códigos numéricos que se pueden introducir en esta columna.
fr: Ajoutez de nouvelles données de transaction sur cette feuille (une ligne par transaction). Les données de cette feuille écraseront toutes les données de transaction existantes dans IATI Publisher, veillez donc à ne pas supprimer les lignes que vous souhaitez conserver. Reportez-vous à la `liste de codes de type de transaction <https://iatistandard.org/en/iati-standard/203/codelists/transactiontype/>`_ pour comprendre les différents codes numériques que vous pouvez saisir dans cette colonne.

source: Go to 'Add or Import Activity' from IATI Publisher's header menu, then select 'Import Activities from .CSV/.XML'.
es: Vaya a "Añadir o importar actividad" en el menú de la cabecera de IATI Publisher y, a continuación, seleccione "Importar actividades desde un archivo .CSV/.XML'.
fr: Cliquez sur « Ajouter ou importer une activité » dans le menu de l'en-tête dʼIATI Publisher, puis sélectionnez « Importer des activités via CSV ou XML ».

source: Upload your edited CSV file. Your `data will be checked <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#pre-import-checks>`_ and validation feedback given after you click "Upload file".
es: Cargue el archivo CSV modificado. Sus `datos se comprobarán <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#pre-import-checks>`_ y se le dará una respuesta relativa a la validación tras hacer clic en "Cargar archivo".
fr: Téléversez votre fichier CSV modifié. Vos `données seront vérifiées <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#pre-import-checks>`_ et un retour dʼinformations vous sera donné pour confirmer la validation après que vous avez cliqué sur « Téléverser le fichier ».

source: Importing via XLSX
es: Importación mediante XLSX
fr: Importation via XLSX

source: Follow the instructions for `exporting your activity data in XLSX format <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_.
es: Siga las instrucciones para `exportar los datos de actividades en formato XLSX <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_.
fr: Suivez les instructions pour `exporter vos données d'activité au format XLSX <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_.

source: Wait for the download to be prepared, then click 'Download' in the bottom-right task box when ready:
es: Espere a que se prepare la descarga y, cuando esté lista, haga clic en "Descargar" en el cuadro de tareas de la parte inferior derecha:
fr: Attendez que le téléchargement soit prêt, puis cliquez sur « Télécharger » dans la boîte de tâches en bas à droite lorsqu'il est prêt :

source: Clicking the bottom-right 'Download' button when the XLSX files have finished being prepared.
es: Haga clic en el botón "Descargar" de la parte inferior derecha cuando los archivos XLSX hayan terminado de prepararse.
fr: Cliquez sur le bouton « Télécharger » en bas à droite une fois la préparation des fichiers XLSX terminée.

source: Within the zipped folder downloaded, extract and open the file titled "activity.xlsx".
es: Dentro de la carpeta comprimida descargada, extraiga y abra el archivo "activity.xlsx".
fr: Dans le dossier zippé téléchargé, extrayez et ouvrez le fichier intitulé « activity.xlsx ».

source: Locate the 'Transaction' sheet within the workbook. Add new transaction data on this sheet, ensuring one row per transaction. Data on this sheet will overwrite any existing transaction data in IATI Publisher, so make sure that you do not remove rows that you want to keep. Save the XLSX file when finished.
es: Busque la hoja "Transaction" dentro del libro. Añada los datos de la nueva transacción en esta hoja, cerciorándose de que haya una fila por transacción. Los datos de esta hoja se sobrescribirán por encima de cualquier dato de transacción que haya en IATI Publisher, por lo que deberá tener cuidado de no eliminar filas que desee conservar. Guarde el archivo XLSX cuando haya terminado.
fr: Localisez la feuille « Transaction » dans le classeur. Ajoutez de nouvelles données de transaction sur cette feuille, en veillant à ce quʼil y ait une ligne par transaction. Les données de cette feuille écraseront toutes les données de transaction existantes dans IATI Publisher, veillez donc à ne pas supprimer les lignes que vous souhaitez conserver. Enregistrez le fichier XLSX lorsque vous avez terminé.

source: A screenshot of the Transactions sheet within the XLSX template.
es: Captura de pantalla de la hoja "Transaction" dentro de la plantilla XLSX.
fr: Une capture d'écran de la feuille « Transactions » dans le modèle XLSX.

source: Go to 'Add or Import Activity' from IATI Publisher's header menu, then select 'Import Activities from .XLSX'.
es: Vaya a "Añadir o importar actividad" en el menú de la cabecera de IATI Publisher y, a continuación, seleccione "Importar actividades desde un archivo .XLSX'.
fr: Cliquez sur « Ajouter ou importer une activité » dans le menu de l'en-tête dʼIATI Publisher, puis sélectionnez « Importer des activités via XLSX ».

source: On the 'Import Activities from .XLSX' page, select that you want to import "Basic Activity Elements", then upload your edited XLSX file. Your `data will be checked <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#pre-import-checks>`_ and validation feedback given after you click "Upload file":
es: En la página "Importar actividades desde un archivo .XLSX", seleccione que desea importar "Elementos básicos de la actividad" y, a continuación, cargue su archivo XLSX modificado. Sus `datos se comprobarán <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#pre-import-checks>`_ y se le dará una respuesta relativa a la validación tras hacer clic en "Cargar archivo":
fr: Sur la page « Importer des activités via XLSX », sélectionnez l'importation des « Éléments d'activité de base », puis téléversez votre fichier XLSX modifié. Vos `données seront vérifiées <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#pre-import-checks>`_ et un retour dʼinformations vous sera donné pour confirmer la validation après que vous avez cliqué sur « Téléverser le fichier » :

source: A screenshot of the XLSX import page with "basic activity elements" selected as the import option and a file chosen for upload.
es: Captura de pantalla de la página de importación XLSX con "elementos básicos de la actividad " seleccionados como opción de importación y un archivo elegido para cargar.
fr: Capture d'écran de la page d'importation du fichier XLSX où les « éléments d'activité de base » sélectionnés comme option d'importation et un fichier choisi pour le téléversement.
