Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es, fr

source: About
es: Acerca de
fr: À propos de

source: Home
es: Inicio
fr: Accueil

source: Settings
es: Configuración
fr: Paramètres

source: Organisation Data
es: Datos de la organización
fr: Données de l'organisation

source: Activity Data
es: Datos de actividades
fr: Données d'activité

source: Download
es: Descargar
fr: Télécharger

source: `IATI Publisher <https://publisher.iatistandard.org/>`_ is an online tool for organisations who want to publish data on their development and humanitarian activities according to the IATI Standard. It is free and managed by the IATI Secretariat.
es: `IATI Publisher <https://publisher.iatistandard.org/>`_ es una herramienta en línea para organizaciones que deseen publicar datos sobre sus actividades humanitarias y de desarrollo conforme a la Norma IATI. Es gratuita y está gestionada por la Secretaría de la IATI.
fr: `IATI Publisher <https://publisher.iatistandard.org/>`_ est un outil en ligne destiné aux organisations qui souhaitent publier des données sur leurs activités humanitaires et de développement conformément à la norme de lʼIITA. Il est gratuit et géré par le Secrétariat de l'IITA.

source: IATI Publisher is designed for small to medium-sized organisations who have a limited amount of IATI data to publish. Typically, this refers to organisations with less than 100 IATI activities. An ‘activity’ in IATI is an individual programme, project or other unit of development and humanitarian work, as defined by your organisation.
es: IATI Publisher se ha diseñado para organizaciones pequeñas y medianas que tienen pocos datos de la IATI que publicar. Normalmente, se trata de organizaciones con menos de 100 actividades de la IATI. Una "actividad" de la IATI es un programa individual, un proyecto u otra unidad de trabajo humanitario y de desarrollo, según lo haya definido su organización.
fr: IATI Publisher est conçu pour les petites et moyennes organisations qui n'ont qu'une quantité limitée de données IITA à publier. Il s'agit généralement d'organisations ayant moins de 100 activités IITA. Dans l'IITA, une « activité » est un programme, un projet ou une autre unité de développement et de travail humanitaire, tel que défini par votre organisation.

source: IATI Publisher is designed for people to enter data directly in the interface via online forms. It has some bulk import functionality, but is not recommended for organisations that need to manage their data in external workbooks or other tools. Large organisations, such as donor governments or UN agencies, are advised not to use IATI Publisher for this reason.
es: IATI Publisher está diseñada para que los usuarios introduzcan los datos directamente en la interfaz a través de formularios en línea. Dispone de algunas funciones de importación masiva, pero no se recomienda para organizaciones que necesiten gestionar sus datos en libros externos u otras herramientas. Por este motivo, se aconseja a las grandes organizaciones, como los gobiernos donantes o los organismos de las Naciones Unidas, que no utilicen IATI Publisher.
fr: IATI Publisher est conçu pour que les personnes puissent saisir des données directement depuis l'interface via des formulaires en ligne. Il dispose d'une fonction d'importation groupée, mais n'est pas recommandé aux organisations qui doivent gérer leurs données dans des classeurs externes ou d'autres outils. Il est conseillé aux grandes organisations, telles que les gouvernements donateurs ou les agences des Nations Unies, de ne pas utiliser IATI Publisher pour cette raison.

source: Steps to publishing
es: Pasos para publicar
fr: Étapes de la publication

source: For an overview of what data publishing involves, have a look at our page `How to publish data <https://iatistandard.org/en/guidance/publishing-data/publishing-checklist/>`_.
es: Para ver un resumen de lo que implica la publicación de datos, eche un vistazo a nuestra página `Cómo publicar datos <https://iatistandard.org/en/guidance/publishing-data/publishing-checklist/>`_.
fr: Pour un aperçu de ce qu'implique la publication de données, consultez notre page `Comment publier des données <https://iatistandard.org/en/guidance/publishing-data/publishing-checklist/>`_.

source: If you are using IATI Publisher, you will register with IATI, enter, and publish data using the tool. IATI Publisher will check your data before you publish, using the `IATI Validator <https://validator.iatistandard.org/>`_, and provide feedback on any validation errors against the IATI schema.
es: Si utiliza IATI Publisher, se registrará en la IATI e introducirá y publicará los datos utilizando la herramienta. IATI Publisher comprobará sus datos antes de publicarlos, empleando para ello el `Validador de la IATI <https://validator.iatistandard.org/>`_, y proporcionará información sobre cualquier error de validación con respecto al esquema de la IATI.
fr: Si vous utilisez IATI Publisher, vous vous inscrirez à l'IITA, saisirez et publierez des données à l'aide de l'outil. IATI Publisher vérifiera vos données avant que vous ne les publiiez, en utilisant lʼ`Outil de validation de lʼIITA <https://validator.iatistandard.org/>`_, et fournira un retour d'information sur toute erreur de validation par rapport au schéma IITA.

source: Help & Support
es: Ayuda y asistencia
fr: Aide et assistance

source: `Get in touch <https://iatistandard.org/en/contact/>`_ if you have any questions relating to publishing, using or improving IATI data. You can also find an active community of IATI publishers and users on our community platform `IATI Connect <https://iaticonnect.org/data-publishing-cop/stream>`_.
es: `Póngase en contacto con nosotros <https://iatistandard.org/en/contact/>`_ si tiene alguna pregunta sobre la publicación, el uso o la mejora de los datos de la IATI. Existe una comunidad activa de usuarios de la IATI y entidades que publican de conformidad con la IATI a la que se puede acceder en `IATI Connect <https://iaticonnect.org/data-publishing-cop/stream>`_.
fr: `Contactez-nous <https://iatistandard.org/fr/guidance/get-support/>`_ pour toute question relative à la publication, à l'utilisation ou à l'amélioration des données de l'IITA. Vous trouverez également une communauté active de signataires et d'utilisateurs de l'IITA sur la plateforme de notre communauté `IATI Connect <https://iaticonnect.org/data-publishing-cop/stream>`_.

source: Tool development
es: Desarrollo de las herramientas
fr: Développement d'outils

source: IATI Publisher was first launched in December 2022. It is managed by the IATI Secretariat and has been developed by `YoungInnovations <https://younginnovations.com.np/>`_.
es: IATI Publisher se puso en marcha en diciembre de 2022. Está gestionado por la Secretaría de la IATI y ha sido desarrollado por `YoungInnovations <https://younginnovations.com.np/>`_.
fr: IATI Publisher a été lancé pour la première fois en décembre 2022. Il est géré par le Secrétariat de l'IITA et a été développé par `YoungInnovations <https://younginnovations.com.np/>`_.
