Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/organisation-data.po
Languages: es, fr

source: Organisation data
es: Datos de la organización
fr: Données de l'organisation

source: The IATI data standard includes two types of data file - organisation and activity. The organisation data file includes information such as your organisation’s unique identifier, future-looking budgets, total expenditure and links to reports or strategy documents.
es: La Norma IATI incluye dos tipos de archivos de datos: de organización y de actividad. El archivo de datos de la organización incluye información como el identificador único de su organización, presupuestos prospectivos, gasto total y enlaces a informes o documentos estratégicos.
fr: La norme de données de l'IITA comprend deux types de fichiers de données – organisation et activité. Le fichier de données de l'organisation comprend des informations telles que l'identifiant unique de votre organisation, les budgets prévisionnels, les dépenses totales et des liens vers des rapports ou des documents stratégiques.

source: In IATI Publisher, you must publish organisation data before you can publish activity data. You can start with the basic (“core”) elements and add more information over time.
es: En IATI Publisher deben publicarse los datos de la organización antes de poder publicarse datos de las actividades. Puede empezar con los elementos básicos e ir añadiendo más información con el tiempo.
fr: Dans IATI Publisher, vous devez publier les données relatives à l'organisation avant de pouvoir publier les données relatives à l'activité. Vous pouvez commencer par les éléments de base et ajouter des informations au fur et à mesure.

source: You will be prompted to review and publish organisation data in the 'Get Started' guide.
es: En la guía "Primeros pasos" se le pedirá que revise y publique los datos de la organización.
fr: Vous devrez ensuite examiner et publier les données de l'organisation dans le guide « Premiers pas ».

source: Editing organisation data
es: Modificar los datos de la organización
fr: Modifier les données de l'organisation

source: You can view or edit your organisation data from IATI Publisher's Organisation Data page.
es: Puede ver o modificar los datos de su organización desde la página Datos de la organización de IATI Publisher.
fr: Vous pouvez consulter ou modifier les données de votre organisation depuis la page des données de l'organisation d'IATI Publisher.

source: Some of these data elements are mandatory to populate and are labelled “core” (with a yellow ring symbol). Other elements are optional and can be populated if relevant.
es: Es obligatorio cumplimentar algunos de estos datos, los etiquetados como "básicos" (con el símbolo de un anillo amarillo). Los demás elementos son facultativos y pueden rellenarse si procede.
fr: Certains de ces éléments de données doivent obligatoirement être renseignés et portent à ce titre la mention « de base » et le symbole d'un anneau jaune. Les autres éléments sont facultatifs et peuvent être renseignés le cas échéant.

source: You can search elements by name or filter on completion status.
es: Puede buscar elementos por nombre o filtrar por estado de finalización.
fr: Vous pouvez rechercher des éléments par leur nom ou les filtrer en fonction de leur état dʼavancement.

source: Publishing organisation data
es: Publicación de los datos de la organización
fr: Publier les données du profil de l'organisation.

source: Ensure that core elements have been completed on the Organisation Data page
es: Compruebe que se han cumplimentado los elementos básicos en la página Datos de la organización
fr: S'assurer que les éléments de base ont été renseignés sur la page des données de l'organisation

source: Click “Publish” in the top right of the screen
es: Haga clic en "Publicar" en la parte superior derecha de la pantalla
fr: Cliquez sur « Publier » en haut à droite de l'écran

source: Click “Continue” after core element completeness has been checked
es: Haga clic en "Continuar" una vez comprobada la integridad de los elementos básicos
fr: Cliquez sur « Continuer » après avoir vérifié que les éléments de base sont complets

source: Publication of your organisation data will be confirmed
es: Se confirmará la publicación de los datos de su organización
fr: La publication des données de votre organisation sera confirmée

source: You can edit information on the Organisation Data page at any time to update what you have published. After any changes, you will see the option to “Republish” in the top right.
es: Puede modificar la información en la página Datos de la organización en cualquier momento para actualizar lo que ha publicado. Después de cualquier cambio, verá la opción "Volver a publicar" en la parte superior derecha.
fr: Vous pouvez à tout moment modifier les informations figurant sur la page Données de l'organisation afin de mettre à jour ce que vous avez publié. Après toute modification, vous verrez l'option « Republier » en haut à droite.

source: You need to publish organisation data in IATI Publisher before you can publish activity data. Once published, you can edit, add to and republish your organisation data at any time.
es: Es necesario publicar los datos de la organización en IATI Publisher antes de poder publicar datos de las actividades. Una vez publicados, puede modificar, añadir y volver a publicar los datos de su organización en cualquier momento.
fr: Vous devez publier les données de l'organisation dans IATI Publisher avant de pouvoir publier les données d'activité. Une fois publiées, vous pouvez modifier, compléter et republier les données de votre organisation à tout moment.
