Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/profile.po
Languages: fr

source: Managing your profile
fr: Gestion de votre profil

source: While signed in to IATI Publisher, you can access your profile information via the user icon in the top-right corner of the screen. Click this, then select 'Your Profile' from the drop-down menu.
fr: Lorsque vous êtes connecté à IATI Publisher, vous pouvez accéder à votre profil en cliquant sur l'icône de l'utilisateur dans le coin supérieur droit de l'écran. Cliquez sur ce lien, puis sélectionnez « Votre profil » dans le menu déroulant.

source: A screenshot of where to find 'Your Profile' in IATI Publisher's user menu (while the user is signed in)
fr: Une capture d'écran de l'endroit où se trouve « Votre profil » dans le menu utilisateur d'IATI Publisher (lorsque l'utilisateur est connecté)

source: Figure 1: Accessing 'Your Profile' from IATI Publisher's top-right dropdown menu.
fr: Figure 1 : Accéder à « Votre profil » depuis le menu déroulant en haut à droite d'IATI Publisher.

source: You can edit the following on your profile page:
fr: Vous pouvez modifier les éléments suivants sur votre page de profil :

source: Name
fr: Nom

source: Username
fr: Nom d'utilisateur

source: Email address
fr: Adresse électronique

source: Language preference
fr: Préférence linguistique

source: Password
fr: Mot de passe
