Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/publishing-settings.po
Languages: es, fr

source: Publishing settings
es: Configuración de las publicaciones
fr: Paramètres de publication

source: If you signed up via the 'My organisation is new to IATI' registration route, your publishing settings will be automatically populated and no further action is needed. You can skip to the next section on `Default Values <https://docs.publisher.iatistandard.org/en/latest/default-values/>`_.
es: Si se ha inscrito a través de la opción "Mi organización es nueva en la IATI", la configuración de publicación se completará automáticamente, sin tener que hacer nada más. Puede pasar a la siguiente sección, sobre `Valores predeterminados <https://docs.publisher.iatistandard.org/en/latest/default-values/>`_.
fr: Si vous avez suivi la voie d’inscription « Mon organisation est nouvelle au sein de l'IITA », vos paramètres de publication seront automatiquement renseignés sans quʼaucune autre action ne soit nécessaire. Vous pouvez passer à la section suivante sur les `Valeurs par défaut <https://docs.publisher.iatistandard.org/en/latest/default-values/>`_.

source: If your organisation was previously registered with IATI, you need to link your IATI Publisher account to your account on the IATI Registry by following the steps below.
es: Si su organización ya estaba registrada en la IATI, deberá vincular su cuenta de IATI Publisher a su cuenta del Registro de la IATI siguiendo los pasos que se indican a continuación.
fr: Si votre organisation était déjà inscrite à l'IITA, vous devez relier votre compte IATI Publisher à votre compte sur le registre de l'IITA en suivant les étapes ci-dessous.

source: 1) Generate an API token
es: 1) Generar una clave de API
fr: 1) Générer un jeton API

source: Log in to the `IATI Registry <https://iatiregistry.org/publisher/>`_ (note - credentials for the IATI Registry are not the same as for IATI Publisher)
es: Inicie sesión en el `Registro de la IATI <https://iatiregistry.org/publisher/>`_ (nota: las credenciales para el Registro de la IATI no son las mismas que para IATI Publisher)
fr: Se connecter au « `Registre de lʼIITA <https://iatiregistry.org/publisher/>`_ »(remarque : les identifiants pour le registre de lʼIITA Registry ne sont pas les mêmes que pour IATI Publisher)

source: Click "My Account” in the top-right, then on the tab 'API Tokens'
es: Haga clic en "Mi cuenta" en la parte superior derecha y, a continuación, en la pestaña "Claves de API"
fr: Cliquez sur « Mon compte » en haut à droite, puis sur l'onglet « Jetons API »

source: Enter a name for the new token (this can be anything)
es: Introduzca un nombre para la nueva clave (el que desee)
fr: Entrez un nom pour le nouveau jeton (il peut s'agir de n'importe quoi)

source: Click 'Create API token'
es: Haga clic en "Crear clave de API"
fr: Cliquez sur « Créer un jeton API »

source: Copy the API token string that appears at the top of the screen
es: Copie la cadena de la clave de API que aparece en la parte superior de la pantalla
fr: Copiez la chaîne du jeton API qui apparaît en haut de l'écran

source: 2) Copy your API token to IATI Publisher
es: 2) Copie su clave de API en IATI Publisher
fr: 2) Copiez votre code API dans IATI Publisher

source: Go to 'Settings' in the IATI Publisher main menu
es: Vaya a "Configuración" en el menú principal de IATI Publisher
fr: Sélectionnez les « Paramètres » dans le menu principal d'IATI Publisher

source: Paste the API token copied from the IATI Registry into the 'API token' box
es: Pegue la clave de API copiada del Registro de la IATI en la casilla "clave de API"
fr: Collez le jeton API copié depuis le registre de lʼIITA dans la case « jeton API »

source: Click the 'Verify' button to check your API Token. You will see either a green “Correct” label or a red “Incorrect” one
es: Haga clic en el botón "Verificar" para comprobar su clave de API. Verá una etiqueta verde "Correcta" o una roja "Incorrecta"
fr: Cliquez sur le bouton "Vérifier" pour vérifier votre jeton API. Vous verrez apparaître une étiquette verte "Correct" ou une étiquette rouge "Incorrect"

source: Once your API token is correct, click on 'Save Publishing Settings' to save your information
es: Cuando la clave de API sea correcta, haga clic en "Guardar configuración de las publicaciones" para guardar la información
fr: Une fois que votre jeton API est confirmé comme correct, cliquez sur « Enregistrer les paramètres de publication » pour sauvegarder vos informations
