Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/publish-activity.po
Languages: es, fr

source: Publishing an activity
es: Publicación de actividades
fr: Publier une activité

source: Activities can be published from the listing page, or from an individual activity's detail page.
es: Las actividades pueden publicarse desde la página del listado o desde la página de detalles de una actividad individual.
fr: Il est possible de publier les activités depuis la page de liste des activités ou la page descriptive d'une activité individuelle.

source: *Publishing multiple activities from the activity listing page:*
es: *Publicación de varias actividades desde la página del listado de actividades:*
fr: *Publication de plusieurs activités depuis la page de la liste des activités :*

source: Publishing multiple activities from the activity list.
es: Publicación de varias actividades desde la lista de actividades.
fr: Publication de plusieurs activités à partir de la liste des activités:

source: *Publishing a single activity from the activity detail page:*
es: *Publicación de una sola actividad desde la página de detalles de la actividad:*
fr: *Publication d'une activité unique à partir de la page descriptive de l'activité:*

source: Publishing a single activity from the activity detail page.
es: Publicación de una sola actividad desde la página de detalles de la actividad.
fr: Publication d'une activité unique à partir de la page descriptive de l'activité.

source: If the activity has been edited since it was first published, you will see the option to 'Republish'. Republishing is necessary to update your public data.
es: Si se ha modificado la actividad desde que se publicó por primera vez, verá la opción "Volver a publicar". Es necesario volver a publicar para actualizar sus datos públicos.
fr: Si l'activité a été modifiée depuis sa première publication, vous verrez l'option « Republier ». La republication est nécessaire pour mettre à jour vos données publiques.

source: Publishing workflow
es: Flujo de publicación
fr: Processus de publication

source: **Checking core elements**
es: **Comprobación de los elementos básicos**
fr: **Vérification des éléments de base**

source: After clicking to publish an activity, IATI Publisher will check first for 'core element' completeness. It is recommended that you populate core elements based on IATI Standard rules and most donor governments’ publishing requirements.
es: Tras hacer clic para publicar una actividad, IATI Publisher comprobará en primer lugar si el "elemento básico" está completo. Se recomienda rellenar los elementos básicos basándose en las reglas de la Norma IATI y en los requisitos de publicación de la mayoría de los gobiernos donantes.
fr: Une fois que vous aurez cliqué pour publier une activité, IATI Publisher vérifiera d'abord que l'élément de base est complet. Il est recommandé de renseigner les éléments de base selon les règles de la norme de l'IITA et les exigences de publication de la plupart des gouvernements donateurs.

source: Core elements are labelled with yellow rings in the IATI Publisher interface:
es: Los elementos básicos están marcados con anillos amarillos en la interfaz de IATI Publisher:
fr: Les éléments de base sont marqués d'un anneau jaune dans l'interface d'IATI Publisher :

source: Displaying core (recommended) elements to populate for your activity.
es: Visualización de los elementos básicos (recomendados) que debe rellenar para su actividad.
fr: Affichage des éléments de base (recommandés) à remplir pour votre activité.

source: You will see a warning message if any of the activities you are trying to publish are missing core elements:
es: Verá un mensaje de advertencia si alguna de las actividades que intenta publicar carece de elementos básicos:
fr: Un message d'avertissement s'affiche si l'une des activités que vous essayez de publier manque d'éléments de base :

source: Warning message about some core elements being missing.
es: Mensaje de advertencia sobre la ausencia de algunos elementos básicos.
fr: Message d'avertissement concernant l'absence de certains éléments de base.

source: You can cancel publishing at this point to go back and review your activities. Ensuring core elements are complete will help avoid errors at the next validation step.
es: Puede cancelar la publicación en este momento para volver atrás y revisar sus actividades. Comprobar que los elementos básicos están completos ayudará a evitar errores en el siguiente paso de validación.
fr: Vous pouvez annuler la publication à ce stade pour revenir en arrière et examiner vos activités. Le fait de s'assurer que les éléments de base sont complets permet d'éviter les erreurs lors de l'étape de validation à suivre.

source: **Data validation**
es: **Validación de datos**
fr: **Validation des données**

source: If you continue to publish, your activity data is checked next using the IATI Validator. This assesses data based on the rules and guidance of the IATI Standard, to make sure it is accessible and useful to data users.
es: Si pasa a la fase de publicación, los datos de su actividad se comprueban mediante el Validador de la IATI. Evalúa los datos basándose en las reglas y orientaciones de la Norma IATI, para comprobar que sean accesibles y útiles para los usuarios.
fr: Si vous poursuivez la publication, les données de votre activité sont ensuite vérifiées à l'aide de lʼoutil de validation de l'IITA. Il évalue les données sur la base des règles et des orientations de la norme de lʼIITA, afin de s'assurer qu'elles sont accessibles et utiles aux utilisateurs des données.

source: Activities with validation issues are labelled in a list:
es: Las actividades con problemas de validación se etiquetan en una lista:
fr: Les activités présentant des problèmes de validation sont recensées dans une liste :

source: Feedback displayed on validation errors before publication.
es: Se muestra información sobre los errores de validación antes de la publicación.
fr: Retour d'information sur les erreurs de validation avant la publication.

source: Click on 'Open in new tab' to view your activity. On the activity detail page, expanding the text box in the top right will display information on the validation errors:
es: Haga clic en "Abrir en una nueva pestaña" para ver su actividad. En la página de detalles de la actividad, al ampliar el cuadro de texto de la parte superior derecha se mostrará información sobre los errores de validación:
fr: Cliquez sur « Ouvrir dans un nouvel onglet » pour visualiser votre activité. Sur la page descriptive de l'activité, le fait de développer la zone de texte en haut à droite permet d'afficher des informations sur les erreurs de validation :

source: Display of more detail on the validation error(s).
es: Visualización de más información sobre el error o errores de validación.
fr: Affichage de détails sur les erreurs de validation.

source: You can often click on each error to be taken to the relevant data entry form in IATI Publisher where a correction is needed.
es: Muchas veces es posible hacer clic en cada error para acceder al formulario de introducción de datos correspondiente en IATI Publisher, donde se requiere una corrección.
fr: Vous pouvez souvent cliquer sur chaque erreur pour accéder au formulaire de saisie de données adéquat dans IATI Publisher lorsquʼune correction est nécessaire.

source: There are different levels of severity for validation errors. Importantly, you will not be able to publish any activity that has critical errors. Critical errors usually prevent your activity from being publicly visible in IATI’s tools, so it is important to correct these before publication.
es: Existen diferentes niveles de gravedad de los errores de validación. Cabe mencionar que no podrá publicar ninguna actividad que tenga errores críticos. Los errores críticos suelen impedir que su actividad sea visible públicamente en las herramientas de la IATI, por lo que es importante corregirlos antes de la publicación.
fr: Il existe différents niveaux de gravité pour les erreurs de validation. Il est important de noter que vous ne pourrez pas publier une activité comportant des erreurs critiques. Les erreurs critiques empêchent généralement votre activité d'être visible publiquement dans les outils de l'IITA ; il est donc important de les corriger avant publication.

source: If you return to the publication process after having made changes to one of your activities, you will be prompted to revalidate (i.e. recheck) your data before continuing:
es: Si vuelve al proceso de publicación después de haber hecho cambios en una de sus actividades, se le pedirá que revalide (es decir, que vuelva a comprobar) sus datos antes de continuar:
fr: Si vous revenez au processus de publication après avoir apporté des modifications à l'une de vos activités, vous devrez revalider (c'est-à-dire revérifier) vos données avant de continuer :

source: Revalidating an activity after making changes.
es: Revalidar una actividad después de realizar cambios.
fr: Revalider une activité après y avoir apporté des modifications.

source: **Data publication**
es: **Publicación de datos**
fr: **Publication de données**

source: If no errors are found during the validation step, IATI Publisher will continue to publish your activities.
es: Si no se encuentra ningún error durante el paso de validación, IATI Publisher pasará al paso de publicación de sus actividades.
fr: Si aucune erreur n'est trouvée lors de l'étape de validation, IATI Publisher continuera à publier vos activités.

source: You’ll see a confirmation screen once publication has completed:
es: Verá una pantalla de confirmación una vez finalizada la publicación:
fr: Un écran de confirmation s'affiche une fois la publication terminée :

source: Confirmation that your activity data has been published.
es: Confirmación de que se han publicado los datos de su actividad.
fr: Confirmation de la publication de vos données d'activité.

source: Unpublishing activity data
es: Despublicación de los datos de una actividad
fr: Annuler la publication de données dʼactivité

source: Once published, IATI activities should remain public even after they have finished. You can update and republish your activity data as often as needed, for example to update budgets or end dates.
es: Una vez publicadas, las actividades de la IATI deben seguir siendo públicas incluso después de haber finalizado. Puede actualizar y volver a publicar los datos de su actividad tantas veces como sea necesario, por ejemplo, para actualizar presupuestos o fechas de finalización.
fr: Une fois publiées, les activités de l'IITA doivent rester publiques même au-delà de leur terme. Vous pouvez mettre à jour et republier vos données d'activité aussi souvent que nécessaire, par exemple pour mettre à jour les budgets ou les dates de fin.

source: In some cases, however, activity data needs to be removed from public view. To do this, you can 'unpublish' your activity in IATI Publisher.
es: En algunos casos, sin embargo, los datos de la actividad deben ocultarse de la vista pública. Para ello, puede "despublicar" su actividad en IATI Publisher.
fr: Dans certains cas, cependant, les données d'activité doivent être soustraites à la vue du public. Pour ce faire, vous pouvez « annuler la publication » de votre activité dans IATI Publisher.

source: To delete an activity from the IATI Publisher interface, select its checkbox in the activity list then click on the trash can icon next to 'Add Activity'. Deleting permanently removes the activity from IATI Publisher. You will be asked to unpublish the activity first, if applicable.
es: Para eliminar una actividad de la interfaz de IATI Publisher, seleccione su casilla de verificación en la lista de actividades y, a continuación, haga clic en el icono de la papelera situado junto a "Añadir actividad". La supresión elimina definitivamente la actividad de IATI Publisher. Primero se le pedirá que despublique la actividad, si procede.
fr: Pour supprimer une activité de l'interface d'IATI Publisher, cochez sa case dans la liste des activités puis cliquez sur l'icône de la corbeille à côté de « Ajouter une activité ». La suppression supprime définitivement l'activité d'IATI Publisher. Le cas échéant, il vous sera dʼabord demandé dʼannuler la publication de lʼactivité.
