Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/results-import.po
Languages: es, fr

source: How do I import results data?
es: ¿Cómo se importan los datos de los resultados?
fr: Comment importer des données de résultats ?

source: Activity results data can be imported to IATI Publisher via XLSX files. There is a separate XLSX template to use for each of results, indicators and periods.
es: Los datos de los resultados de las actividades pueden importarse a IATI Publisher mediante archivos XLSX. Existe una plantilla XLSX distinta para cada uno de los resultados, indicadores y períodos.
fr: Les données relatives aux résultats des activités peuvent être importées dans IATI Publisher via des fichiers XLSX. Il existe un modèle XLSX distinct à utiliser pour lʼensemble des résultats, indicateurs et périodes.

source: Instead of populating the blank XLSX templates, it is typically easiest to add at least one result, indicator and period via IATI Publisher's interface first. This way, you can `export your existing activity data <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_ and see how it appears in each of IATI Publisher's XLSX templates. You can then add to or edit the data as required, before re-importing.
es: En lugar de rellenar las plantillas en blanco XLSX, suele ser más fácil añadir primero al menos un resultado, un indicador y un período a través de la interfaz de IATI Publisher. De este modo, se pueden `exportar los datos de actividades existentes <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_ y ver cómo aparecen en cada una de las plantillas XLSX de IATI Publisher. A continuación, puede añadir o modificar los datos según sea necesario, antes de volver a importarlos.
fr: Au lieu de remplir des modèles XLSX vierges, il est généralement plus facile d'ajouter d'abord au moins un résultat, un indicateur et une période via l'interface d'IATI Publisher. De cette façon, vous pouvez `exporter vos données d'activité existantes <https://docs.publisher.IITAstandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_ et voir comment elles apparaissent dans chacun des modèles XLSX d'IATI Publisher. Vous pouvez ensuite compléter ou modifier les données si nécessaire, avant de les réimporter.

source: What information do I need in the import templates?
es: ¿Qué información deben contener las plantillas de importación?
fr: Quelles sont les informations à inclure dans les modèles d'importation ?

source: 1) Result template
es: 1) Plantilla de resultados
fr: 1) Modèle de résultat

source: The *Result_Mapper* sheet contains the following three columns:
es: La hoja *Result_Mapper* contiene las tres columnas siguientes:
fr: La feuille *Result_Mapper* contient les trois colonnes suivantes :

source: **Activity Identifier** - this is used to associate your result with the right activity in IATI Publisher. The activity identifier is the second part of the 'iati-identifier' string, which uniquely identifies each of your activities within your organisation's data.
es: **Identificador de actividad**: se utiliza para vincular el resultado a la actividad correcta en IATI Publisher. El identificador de actividad es la segunda parte de la cadena "iati-identifier", que identifica de forma única cada una de sus actividades dentro de los datos de su organización.
fr: **Identifiant d'activité** - il est utilisé pour associer votre résultat à la bonne activité dans IATI Publisher. L'identifiant d'activité constitue la deuxième partie de la chaîne « iati-identifier », qui identifie de manière unique chacune de vos activités parmi les données de votre organisation.

source: **Result Number** - a number or text string that uniquely identifies each result within a particular activity. You can choose what this string is if creating a new result via the import template. Results created within the IATI Publisher interface will have their result number automatically created by the system.
es: **Número de resultado**: número o cadena de texto que identifica de forma única cada resultado dentro de una actividad concreta. Puede elegir cuál es esta cadena si crea un nuevo resultado a través de la plantilla de importación. Los resultados creados en la interfaz de IATI Publisher tendrán un número de resultado generado automáticamente por el sistema.
fr: **Numéro de résultat** - un nombre ou une chaîne de texte qui identifie de manière unique chaque résultat d'une activité particulière. Vous pouvez choisir cette chaîne si vous créez un nouveau résultat via le modèle d'importation. Les résultats créés dans l'interface dʼIATI Publisher se verront automatiquement attribuer un numéro de résultat par le système.

source: **Result Identifier** - this is autopopulated in the Result import template, based on the Activity Identifier and Result Number entered in the previous columns.
es: **Identificador de resultado**: se rellena automáticamente en la plantilla de importación de resultados, a partir del identificador de actividad y el número de resultado introducidos en las columnas anteriores.
fr: **Identifiant de résultat** – ce champ est rempli automatiquement dans le modèle d'importation des résultats, sur la base de l'identifiant de l'activité et du numéro de résultat saisis dans les colonnes précédentes.

source: 2) Indicator template
es: 2) Plantilla de indicadores
fr: 2) Modèle d'indicateur

source: The *Indicator_Mapper* sheet contains the following three columns:
es: La hoja *Indicator_Mapper* contiene las tres columnas siguientes:
fr: La feuille *Indicator_Mapper* contient les trois colonnes suivantes :

source: **Result Identifier** - this is used to associate your indicator with the right result in IATI Publisher.
es: **Identificador de resultado**: se utiliza para vincular su indicador con el resultado correcto en IATI Publisher.
fr: **Identifiant de résultat** – il est utilisé pour associer votre indicateur au bon résultat dans IATI Publisher.

source: **Indicator Number** - a number or text string that uniquely identifies each indicator within a particular result (similar to Result Number).
es: **Número de indicador**: número o cadena de texto que identifica de forma única cada indicador dentro de un resultado concreto (análogo al número de resultado).
fr: **Numéro de l'indicateur** – un nombre ou une chaîne de texte qui identifie de manière unique chaque indicateur dans un résultat particulier (similaire au numéro de résultat).

source: **Indicator Identifier** - this is autopopulated in the Indicator import template, based on the Result Identifier and Indicator Number entered in the previous columns.
es: **Identificador de indicador**: se rellena automáticamente en la plantilla de importación de indicadores, a partir del identificador del resultado y el número de indicador introducidos en las columnas anteriores.
fr: **Identifiant de l'indicateur** – ce champ est rempli automatiquement dans le modèle d'importation de l'indicateur, sur la base de l'identifiant du résultat et du numéro de l'indicateur saisis dans les colonnes précédentes.

source: 3) Period template
es: 3) Plantilla de períodos
fr: 3) Modèle de période

source: The *Period_Mapper* sheet contains the following three columns:
es: La hoja *Period_Mapper* contiene las tres columnas siguientes:
fr: La feuille *Period_Mapper* contient les trois colonnes suivantes :

source: **Indicator Identifier** - this is used to associate your period with the right indicator in IATI Publisher.
es: **Identificador de indicador**: se utiliza para vincular su período con el indicador correcto en IATI Publisher.
fr: **Identifiant de l'indicateur** – il est utilisé pour associer votre période à l'indicateur adéquat dans IATI Publisher.

source: **Period Number** - a number or text string that uniquely identifies each period within a particular indicator (similar to Indicator Number).
es: **Número de período**: número o cadena de texto que identifica de forma única cada período dentro de un indicador concreto (análogo al número de indicador).
fr: **Numéro de période** – un nombre ou une chaîne de texte qui identifie de manière unique chaque période au sein d'un indicateur particulier (similaire au numéro d'indicateur).

source: **Period Identifier** - this is autopopulated in the Period import template, based on the Indicator Identifier and Period Number entered in the previous columns.
es: **Identificador de período**: se rellena automáticamente en la plantilla de importación del período, a partir del identificador del indicador y el número del período introducidos en las columnas anteriores.
fr: **Identificateur de période** – ce champ est rempli automatiquement dans le modèle d'importation de période, sur la base de l'identifiant de l'indicateur et du numéro de période saisis dans les colonnes précédentes.
