Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/results.po
Languages: es, fr

source: Results
es: Resultados
fr: Résultats

source: Each result must have at least one indicator. This is a rule of the IATI Standard and should be followed to avoid errors in your published data.
es: Cada resultado debe contar con al menos un indicador. Se trata de una norma de la IATI que debe respetarse para evitar errores en los datos publicados.
fr: Chaque résultat doit être assorti dʼau moins un indicateur. Il s'agit d'une règle de la norme de lʼIITA qui doit être respectée pour éviter les erreurs dans les données publiées.

source: Periods can be added to indicators to record their target and actual values over time. Periods are not essential to add to your indicators before publishing for the first time. A result can have multiple indicators, and each indicator can have multiple periods.
es: Se pueden añadir períodos a los indicadores para registrar sus valores objetivo y reales a lo largo del tiempo. No es imprescindible añadir períodos a los indicadores antes de publicarlos por primera vez. Los resultados pueden tener varios indicadores y cada indicador varios períodos.
fr: Des périodes peuvent être ajoutées aux indicateurs pour enregistrer leurs valeurs cibles et réelles dans le temps. Il n'est pas indispensable d'ajouter des points à vos indicateurs avant de les publier pour la première fois. Un résultat peut être doré de plusieurs indicateurs et chaque indicateur peut comporter plusieurs périodes.

source: You can add indicators and periods from the activity detail page (Figure 1), or from the individual result page.
es: Puede añadir indicadores y períodos desde la página de detalles de la actividad (Figura 1) o desde la página de resultados individuales.
fr: Vous pouvez ajouter des indicateurs et des périodes depuis la page descriptive de l'activité (figure 1) ou depuis la page des résultats individuels.

source: How to add a new indicator or period from the activity detail page.
es: Cómo añadir un nuevo indicador o período desde la página de detalles de la actividad.
fr: Comment ajouter un nouvel indicateur ou une nouvelle période depuis la page descriptive de l'activité.

source: Figure 1: How to add a new indicator or period from the activity detail page.
es: Figura 1: Cómo añadir un nuevo indicador o período desde la página de detalles de la actividad.
fr: Figure 1 : Comment ajouter un nouvel indicateur ou une nouvelle période depuis la page descriptive de l'activité.

source: Deleting results, indicators or periods
es: Eliminar resultados, indicadores o períodos
fr: Suppression de résultats, d'indicateurs ou de périodes

source: Deleting a result in the interface will delete any indicators or periods associated with it.
es: Al eliminar un resultado en la interfaz se borrarán todos los indicadores o períodos que tenga vinculados.
fr: La suppression d'un résultat dans l'interface entraîne la suppression des indicateurs et des périodes qui lui sont associés.

source: How to delete results from the Results List
es: Cómo eliminar resultados de la Lista de resultados
fr: Comment supprimer des résultats de la liste des résultats

source: Figure 2: How to delete results from the Results List.
es: Figura 2: Cómo eliminar resultados de la Lista de resultados.
fr: Figure 2 : Comment supprimer des résultats de la liste des résultats.

source: To delete an indicator or period, click on 'Show full indicator list' or 'Show full period list' from the activity detail page, then locate the trash can icon next to the entry you want to delete.
es: Para eliminar un indicador o un período, haga clic en "Mostrar la lista completa de indicadores" o "Mostrar la lista completa de períodos" en la página de detalles de la actividad y, a continuación, busque el icono de la papelera junto a la entrada que desea eliminar.
fr: Pour supprimer un indicateur ou une période, cliquez sur « Afficher la liste complète des indicateurs » ou « Afficher la liste complète des périodes » dans la page descriptive de l'activité, puis localisez l'icône de la corbeille à côté de l'entrée que vous souhaitez supprimer.
