Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/sign-*.po
Languages: es, fr

source: Signing in
es: Iniciar sesión
fr: Se connecter

source: Sign in to IATI Publisher with the email address and password that you entered during registration. You can reset your password if needed from `IATI Publisher's homepage <https://publisher.iatistandard.org/>`_.
es: Inicie sesión en IATI Publisher con la dirección de correo electrónico y la contraseña que introdujo al registrarse. Puede restablecer su contraseña si hace falta desde la página de inicio de `IATI Publisher <https://publisher.iatistandard.org/>`_.
fr: Connectez-vous à IATI Publisher avec l'adresse électronique et le mot de passe que vous avez saisis lors de votre inscription. Vous pouvez réinitialiser votre mot de passe si nécessaire depuis la `page d'accueil d'IATI Publisher <https://publisher.IITAstandard.org/>`_.

source: You will have received a verification email after registering. Use the link in this email to activate your new account, which is required before you can publish data.
es: Tras registrarse, habrá recibido un correo electrónico de verificación. Utilice el enlace de este correo electrónico para activar su nueva cuenta, un paso necesario para poder publicar datos.
fr: Vous aurez reçu un e-mail de vérification après votre inscription. Utilisez le lien contenu dans cet e-mail pour activer votre nouveau compte, étape nécessaire pour pouvoir publier des données.

source: When you first sign in, you will see 'Get Started' guidance on screen, which will walk you through remaining setup steps (Figure 1). Select 'Don’t show me this again' in the bottom-left corner of the guidance box to stop it appearing when you sign in. You can re-access it from your profile menu if needed.
es: Cuando inicie sesión por primera vez, verá en pantalla la guía "Primeros pasos", que le orientará por los pasos de configuración restantes (Figura 1). Seleccione "No volver a mostrar este mensaje" en la esquina inferior izquierda del cuadro de orientación para que deje de aparecer cuando inicie sesión. Puede volver a acceder a ella desde el menú de su perfil si lo necesita.
fr: Lorsque vous vous connecterez pour la première fois, vous verrez apparaître à l'écran le guide « Premiers pas », qui vous accompagnera dans les différentes étapes de configuration restantes (figure 1). Sélectionnez « Ne plus afficher » dans le coin inférieur gauche de la boîte d'orientation pour qu'elle n'apparaisse plus lorsque vous vous connectez. Vous pouvez y accéder à nouveau depuis le menu de votre profil si nécessaire.

source: Screenshot of the 'Get Started' onboarding guidance, visible on first sign in, to help your organisation get set up.
es: Captura de pantalla de la guía de incorporación "Primeros pasos", visible en el primer inicio de sesión, para ayudar a configurar su organización.
fr: Capture d'écran du guide d'accueil « Premiers pas », visible lors de la première connexion, pour aider votre organisation à démarrer.

source: *Figure 1: 'Get Started' onboarding guidance to help your organisation get set up.*
es: *Figura 1: Guía de incorporación "Primeros pasos", para ayudar a configurar su organización.*
fr: *Figure 1 : Capture d'écran du guide d'accueil « Premiers pas », visible lors de la première connexion, pour aider votre organisation à démarrer.*

source: Adding other people from your organisation to IATI Publisher
es: Añadir a otras personas de su organización a IATI Publisher
fr: Ajouter d'autres personnes de votre organisation à IATI Publisher

source: If you are a new user from an organisation that is already using IATI Publisher, an admin user from your organisation can create an account for you. You can read more in the `Users section <https://docs.publisher.iatistandard.org/en/latest/users/>`_.
es: Si es usted un usuario nuevo de una organización que ya utiliza IATI Publisher, puede solicitar a un usuario administrador de su organización que cree una cuenta para usted. Puede obtener más información en la `sección Usuarios <https://docs.publisher.iatistandard.org/en/latest/users/>`_.
fr: Si vous êtes un nouvel utilisateur d'une organisation qui utilise déjà IATI Publisher, un utilisateur administrateur de votre organisation peut créer un compte pour vous. Vous pouvez en savoir plus dans la section `section « Utilisateurs » <https://docs.publisher.IITAstandard.org/en/latest/users/>`_.

source: Getting help
es: Obtener ayuda
fr: Obtenir de l'aide

source: If you are unable to sign in, or need help getting access to your organisation's account, please `contact us <https://iatistandard.org/en/contact/>`_.
es: Si no puede iniciar sesión o necesita ayuda para acceder a la cuenta de su organización, `póngase en contacto con nosotros <https://iatistandard.org/en/contact/>`_.
fr: Si vous ne parvenez pas à vous connecter ou si vous avez besoin d'aide pour accéder au compte de votre organisation, veuillez `nous contacter <https://IITAstandard.org/en/contact/>`_.
