Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/users.po
Languages: es, fr

source: Users
es: Usuarios
fr: Utilisateurs

source: IATI Publisher's `Users page <https://publisher.iatistandard.org/users/>`_ lists all individuals in your organisation that have an account. Anyone with admin level permissions can add, edit or remove users from this page.
es: En la página `Usuarios <https://publisher.iatistandard.org/users/>`_ de IATI Publisher se enumeran todas las personas de su organización que tienen una cuenta. Cualquier persona con permisos de administrador puede añadir, modificar o eliminar usuarios de esta página.
fr: La page « Utilisateurs » d'IATI Publisher <https://publisher.IITAstandard.org/users/>`_ liste tous les individus de votre organisation qui ont un compte. Toute personne ayant des droits d'administrateur peut ajouter, modifier ou supprimer des comptes dʼutilisateurs depuis cette page.

source: Adding or removing user accounts
es: Añadir o eliminar cuentas de usuario
fr: Ajouter ou supprimer des comptes d'utilisateurs

source: To add a new user, you will need to enter their full name, email address and user type (see information on user permissions below). You will also create a password for them, which they should change after signing in for the first time.
es: Para añadir un nuevo usuario, deberá introducir su nombre y apellidos, dirección de correo electrónico y tipo de usuario (consulte la información sobre permisos de usuario que se proporciona más adelante). También les creará una contraseña, que deberán cambiar después de iniciar sesión por primera vez.
fr: Pour ajouter un nouvel utilisateur, vous devez saisir son nom complet, son adresse électronique et le type d'utilisateur (voir les informations sur les autorisations des utilisateurs ci-dessous). Vous leur créerez également un mot de passe, qu'ils devront modifier après s'être connectés pour la première fois.

source: User permissions
es: Permisos de usuario
fr: Autorisations des utilisateurs

source: There are two types of user accounts on IATI Publisher - admins and general users. Admins have the highest level of permission for your organisation.
es: Existen dos tipos de cuentas de usuario en IATI Publisher: administradores y usuarios generales. Los administradores tienen el nivel más alto de permisos para su organización.
fr: Il existe deux types de comptes dʼutilisateurs sur IATI Publisher : les administrateurs et les utilisateurs généraux. Les administrateurs disposent du niveau d'autorisation le plus élevé pour votre organisation.

source: **Admin users can:**
es: **Los usuarios administradores pueden:**
fr: **Les utilisateurs administrateurs peuvent :**

source: Add other users to their organisation (setting them as 'co-admins' or 'general users')
es: Añadir otros usuarios a su organización (estableciéndolos como "coadministradores" o "usuarios generales")
fr: Ajouter d'autres utilisateurs à leur organisation (en les définissant comme « co-administrateurs » ou « utilisateurs généraux »)

source: Add, edit and publish activity data
es: Añadir, modificar y publicar datos de actividades
fr: Ajouter, modifier et publier des données d'activité

source: Add, edit and publish organisation data
es: Añadir, modificar y publicar datos de la organización
fr: Ajouter, modifier et publier des données sur l'organisation

source: Edit settings such as default values and your organisation's identifiers
es: Modificar configuraciones como los valores predeterminados y los identificadores de su organización
fr: Modifier les paramètres tels que les valeurs par défaut et les identifiants de votre organisation

source: **General users can:**
es: **Los usuarios generales pueden:**
fr: **Les utilisateurs généraux peuvent :**

source: View, but not edit or add, other users for their organisation
es: Ver a otros usuarios de su organización, pero no modificarlos ni añadirlos
fr: Voir, mais sans modifier ni ajouter, d'autres utilisateurs de leur organisation

source: View, but not edit or publish, organisation data
es: Ver los datos de la organización, pero no modificarlos ni publicarlos
fr: Consulter, mais sans modifier ni publier, les données de l'organisation

source: View, but not edit, settings
es: Ver la configuración, pero no modificarla
fr: Consulter, mais sans modifier, les paramètres
