Repository: IATI/iati-publisher-docs
Catalog: docs/locale/*/LC_MESSAGES/which-template.po
Languages: es, fr

source: Which import template should I use?
es: ¿Qué plantilla de importación debo utilizar?
fr: Quel modèle d'importation dois-je utiliser ?

source: IATI Publisher has activity import templates in CSV and XLSX file format. If you are uploading results data (i.e. results, indicators and periods for existing activities), you will need to use the XLSX import. If you are uploading basic activity data, which can include budgets and transactions, you can choose between the CSV and XLSX imports.
es: IATI Publisher dispone de plantillas de importación de actividades en formato CSV y XLSX. Si va a cargar datos de resultados (es decir, resultados, indicadores y períodos para actividades existentes), tendrá que utilizar la importación XLSX. Si va a cargar datos básicos de las actividades, que pueden incluir presupuestos y transacciones, puede elegir entre las importaciones CSV y XLSX.
fr: IATI Publisher propose des modèles d'importation d'activités aux formats CSV et XLSX. Si vous téléversez des données de résultats (c'est-à-dire des résultats, des indicateurs et des périodes pour des activités existantes), vous devrez utiliser l'importation de fichiers XLSX. Si vous téléversez des données d'activité de base, qui peuvent inclure des budgets et des transactions, vous pouvez choisir entre les importations de fichiers CSV et XLSX.

source: CSV template
es: Plantilla CSV
fr: Modèle CSV

source: IATI Publisher has a single CSV import template, which covers all elements of the IATI Standard for activities apart from `results <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/>`_.
es: IATI Publisher dispone de una única plantilla de importación CSV, que cubre todos los elementos de la Norma IATI para las actividades excepto los `resultados <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/>`_.
fr: IATI Publisher dispose d'un modèle d'importation CSV unique, qui couvre tous les éléments de la norme IITA pour les activités, à l'exception des `résultats <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/>`_.

source: This template is recommended if you:
es: Esta plantilla se recomienda si usted:
fr: Ce modèle est recommandé si vous :

source: want to work in a single flat file, rather than a workbook with multiple sheets
es: desea trabajar en un único archivo sin formato y no en un libro con varias hojas
fr: souhaitez travailler dans un seul fichier plat, plutôt que dans un classeur à feuilles multiples ;

source: don't need embedded codelists or dropdown menus to enter your data
es: no necesita listas de códigos integradas ni menús desplegables para introducir sus datos
fr: nʼavez pas besoin de listes de codes intégrées ou de menus déroulants pour saisir vos données

source: XLSX templates
es: Plantillas XLSX
fr: Modèles XLSX

source: There are four templates available on the `XLSX import page <https://publisher.iatistandard.org/import/xls>`_:
es: En la `página de importación XLSX <https://publisher.iatistandard.org/import/xls>`_ hay cuatro plantillas:
fr: Quatre modèles sont disponibles sur la `page d'importation via XLSX <https://publisher.iatistandard.org/import/xls>`_ :

source: Basic Activity Data - covers core and optional IATI data elements for activities, including transactions
es: Datos básicos de las actividades: abarca los elementos de datos básicos y opcionales de la IATI para las actividades, incluidas las transacciones
fr: Données de base sur les activités – couvre les éléments de données essentiels et facultatifs de l'IITA concernant les activités, y compris les transactions

source: Results - to import `results <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/>`_ for existing activities
es: Resultados: para importar `resultados <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/>`_ de las actividades existentes
fr: Résultats – pour importer des `résultats <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/>`_ pour des activités existantes

source: Indicators - to import `indicators <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/indicator/>`_ for existing results
es: Indicadores: para importar `indicadores <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/indicator/>`_ de los resultados existentes
fr: Indicateurs – pour importer des `indicateurs <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/indicator/>`_ pour des résultats existants

source: Periods - to import `periods <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/indicator/period/>`_ for existing indicators
es: Períodos: para importar `períodos <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/indicator/period/>`_ de los indicadores existentes
fr: Périodes – pour importer des `périodes <https://iatistandard.org/en/iati-standard/203/activity-standard/iati-activities/iati-activity/result/indicator/period/>`_ pour des indicateurs existants

source: These templates are recommended if you:
es: Estas plantillas se recomiendan en los siguientes casos:
fr: Ces modèles sont recommandés si vous :

source: prefer to work in a workbook that has multiple sheets (typically one per element of the IATI Standard)
es: usted prefiere trabajar en un libro con varias hojas (normalmente una por cada elemento de la Norma IATI)
fr: préférez travailler dans un classeur comportant plusieurs feuilles (typiquement une par élément de la norme de lʼIITA)

source: find embedded codelists and dropdown menus helpful for entering your data
es: las listas de códigos integradas y los menús desplegables le resultan útiles para introducir sus datos
fr: trouvez les listes de codes intégrées et les menus déroulants utiles pour la saisie de vos données

source: need help distinguishing between elements of the IATI Standard that require a single entry (e.g. activity status), versus those that accept multiple entries (e.g. budget)
es: necesita ayuda para distinguir entre los elementos de la Norma IATI que requieren una única entrada (por ejemplo, el estado de la actividad) y los que aceptan varias entradas (por ejemplo, el presupuesto)
fr: avez besoin d'aide pour faire la distinction entre les éléments de la norme de lʼIITA qui requièrent une seule entrée (par exemple, le statut de l'activité) et ceux qui admettent des entrées multiples (par exemple, le budget)

source: Only one template can be uploaded at a time. It is normally recommended to `export existing activity data <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_ before adding to it via the import functionality.
es: Solo se puede cargar una plantilla a la vez. Normalmente se recomienda `exportar los datos de actividades existentes <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_ antes de añadirlos mediante la función de importación.
fr: Un seul modèle peut être téléversé à la fois. Il est normalement recommandé d'exporter les données d'activité existantes <https://docs.publisher.iatistandard.org/en/latest/bulk-import/#exporting-your-existing-data>`_ avant de les renseigner au moyen de la fonction d'importation.
